# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging, Joining and Concatenating
* Operations
* Data Input and Output

**Pandas** Stand for **Pan**el **Da**ta

# Series
The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [4]:
import numpy as np
import pandas as pd

## Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [6]:
## Creating list of objects
labels = ['a','b','c']

In [7]:
## Creating List contain data points
my_list = [10,20,30]

In [8]:
## numpy array
arr = np.array([10,20,30])

In [9]:
arr

array([10, 20, 30])

In [10]:
## Creating a Dictionary
d = {'a':10,'b':20,'c':30}

In [11]:
d

{'a': 10, 'b': 20, 'c': 30}

### Using Lists

In [14]:
## Pass my_list and it will show in series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [15]:
## Index=Labels
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [17]:
## display the series
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

### Using NumPy Arrays

In [18]:
## Pass numpy array in pandas series
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [19]:
## Pass numpy array as a data and labels as a indes
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

### Using Dictionaries

In [21]:
## Pass Dictionary in pandas series
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [23]:
## If data is equal to labels
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [31]:
ser1 = pd.Series([1,2,3,4],index = ['Pakistan', 'India','USA', 'Afghanistan'])

In [32]:
ser2 = pd.Series([1,2,5,4],index = ['Pakistan','India', 'USA', 'Japan'])

In [33]:
ser2

Pakistan    1
India       2
USA         5
Japan       4
dtype: int64

In [34]:
ser1['USA']

3

Operations are then also done based off of index:

In [35]:
ser1 + ser2
## NaN ---> Missing Match

Afghanistan    NaN
India          4.0
Japan          NaN
Pakistan       2.0
USA            8.0
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [146]:
import pandas as pd
import numpy as np

In [147]:
from numpy.random import randn
## seed ---> for getting same numbers like video lectr
np.random.seed(101)

In [148]:
## creating a 5 by 6 matrix of rand numbers having value b/w -1 and 1
rand_mat= randn(5,4)

In [149]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [150]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns='W X Y Z'.split())

In [151]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [152]:
## display the 'W' column
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [153]:
## Pass a list of column names
my_list= df[['W','Z']]

In [154]:
my_list

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [155]:
## SQL Syntax (NOT RECOMMENDED!)
## not a good method
## recommend to not to use
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [156]:
## type of the 'W' column
type(df['W'])

pandas.core.series.Series

### Creating a new column:

In [157]:
## Creating new column which is equal to sum of W and Y
df['new'] = df['W'] + df['Y']

In [158]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Removing Columns

In [159]:
## drop/delete a column (axis=1 means to drop a column)
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [160]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [161]:
## to delete permanetly from the dataframe, use inplace
df.drop('new',axis=1,inplace=True)

In [162]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [163]:
## drop/delete a row (axis=0 means to drop a row)
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

### Selecting Rows

In [164]:
## calling by label
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Or select based off of position instead of label

In [165]:
## calling by integer/index location
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [166]:
## calling by integer/index location
df.iloc[[0,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

### Selecting subset of rows and columns

In [167]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [168]:
## row B and Column Y
df.loc['B','Y']

-0.8480769834036315

In [169]:
## Row A & B, Column W & Y
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [170]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [171]:
## To Know about the values greater then 0 in dataframe 
df_bool= df>0

In [172]:
df_bool

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [173]:
## passing the values greater then 0 in Dataframe
## display the Nan---> where the num not grater then 0
df[df_bool]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [174]:
## Filter out the data from column 'W'
[df['W']>0]

[A     True
 B     True
 C    False
 D     True
 E     True
 Name: W, dtype: bool]

In [175]:
## display the filtered dataframe
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

For two conditions you can use | and & with parenthesis:

In [176]:
cond1=df['W']>0
cond2=df['Y']>1

In [177]:
cond= cond1 & cond2

In [178]:
df[cond]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [179]:
## 2nd method
df[(df['W']>0) &(df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [180]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [181]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [182]:
## Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [183]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [184]:
## Reset to default 0,1...n index
## change permanently
df.reset_index(inplace= True)

In [185]:
## index reset to 0,1,2,3,4
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [186]:
## adding new index to list
new_ind = 'Ali Aslam Ahmad Asad Anwar'.split()

In [187]:
## Assigning name to new index column
df['Students'] = new_ind

In [188]:
df

  index         W         X         Y         Z Students
0     A  2.706850  0.628133  0.907969  0.503826      Ali
1     B  0.651118 -0.319318 -0.848077  0.605965    Aslam
2     C -2.018168  0.740122  0.528813 -0.589001    Ahmad
3     D  0.188695 -0.758872 -0.933237  0.955057     Asad
4     E  0.190794  1.978757  2.605967  0.683509    Anwar

In [191]:
## Set Student column to index
df.set_index('Students')

         index         W         X         Y         Z
Students
Ali          A  2.706850  0.628133  0.907969  0.503826
Aslam        B  0.651118 -0.319318 -0.848077  0.605965
Ahmad        C -2.018168  0.740122  0.528813 -0.589001
Asad         D  0.188695 -0.758872 -0.933237  0.955057
Anwar        E  0.190794  1.978757  2.605967  0.683509

In [192]:
df

  index         W         X         Y         Z Students
0     A  2.706850  0.628133  0.907969  0.503826      Ali
1     B  0.651118 -0.319318 -0.848077  0.605965    Aslam
2     C -2.018168  0.740122  0.528813 -0.589001    Ahmad
3     D  0.188695 -0.758872 -0.933237  0.955057     Asad
4     E  0.190794  1.978757  2.605967  0.683509    Anwar

In [193]:
## changes permanently
df.set_index('Students',inplace=True)

In [194]:
df

         index         W         X         Y         Z
Students
Ali          A  2.706850  0.628133  0.907969  0.503826
Aslam        B  0.651118 -0.319318 -0.848077  0.605965
Ahmad        C -2.018168  0.740122  0.528813 -0.589001
Asad         D  0.188695 -0.758872 -0.933237  0.955057
Anwar        E  0.190794  1.978757  2.605967  0.683509

In [198]:
df['W']> 0

Students
Ali       True
Aslam     True
Ahmad    False
Asad      True
Anwar     True
Name: W, dtype: bool

In [199]:
## assigning a variable
ser_w= df['W']>0

In [203]:
## display the bolean form of series
ser_w

Students
Ali       True
Aslam     True
Ahmad    False
Asad      True
Anwar     True
Name: W, dtype: bool

In [201]:
## gives the information about true values in series 
sum(ser_w)

4

In [204]:
## len of total series 
len(ser_w)

5

## DataFrame Summaries
There are a couple of ways to obtain summary data on DataFrames.<br>
<tt><strong>df.describe()</strong></tt> provides summary statistics on all numerical columns.<br>
<tt><strong>df.info and df.dtypes</strong></tt> displays the data type of all columns.

In [205]:
## description of dataframe
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [206]:
## datatype of dataframe
df.dtypes

index     object
W        float64
X        float64
Y        float64
Z        float64
dtype: object

In [207]:
## information of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Ali to Anwar
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   5 non-null      object
 1   W       5 non-null      float64
 2   X       5 non-null      float64
 3   Y       5 non-null      float64
 4   Z       5 non-null      float64
dtypes: float64(4), object(1)
memory usage: 412.0+ bytes

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [208]:
import numpy as np
import pandas as pd

In [209]:
## creating/passing a dataframe/Dictionary
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [210]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [211]:
## drop na
df.dropna()

     A    B  C
0  1.0  5.0  1

In [212]:
## drop columns contains na
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [229]:
## thresh-hold optional integer
## thresh=2 means ---> Keep only the rows having 2 or more valid data
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [231]:
## fill the value in where any element is na
df.fillna(value='FILL Vaule')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL Vaule  2
2  FILL Vaule  FILL Vaule  3

In [232]:
## fill the 0 in where any element is na
df.fillna(value='0')

     A    B  C
0  1.0  5.0  1
1  2.0    0  2
2    0    0  3

In [234]:
## fill missing value with the avg value
## column A having avg=1.5 so, fill the missing value by 1.5
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [235]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [238]:
## filling avg value by column wise
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [239]:
## filling avg value by column wise
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [265]:
import pandas as pd
##  Create dataframe
data = {'Company':['Tesla','Dell','FB','Dell','FB','Tesla'],
       'Person':['Abdul_Wasay','Ali','Ahmad','Adnan','Shaukat','Basharat'],
       'Sales':[5000,3010,4310,4124,2243,5350]}

In [266]:
df = pd.DataFrame(data)

In [267]:
df

  Company       Person  Sales
0   Tesla  Abdul_Wasay   5000
1    Dell          Ali   3010
2      FB        Ahmad   4310
3    Dell        Adnan   4124
4      FB      Shaukat   2243
5   Tesla     Basharat   5350

<strong>Now you can use the .groupby() method to group rows together based off of a column name.<br>For instance let's group based off of Company. This will create a DataFrameGroupBy object:</strong>

In [268]:
## group the company
df.groupby('Company')

You can save this object as a new variable:

In [269]:
by_company = df.groupby('Company')

And then call aggregate methods off the object:

In [270]:
## group the comapnies by mean value
## same comapnies are grouped by mean vlaue
by_company.mean()

          Sales
Company
Dell     3567.0
FB       3276.5
Tesla    5175.0

In [271]:
df.groupby('Company').mean()

          Sales
Company
Dell     3567.0
FB       3276.5
Tesla    5175.0

More examples of aggregate methods:

In [273]:
by_company.std()

               Sales
Company
Dell      787.716954
FB       1461.589717
Tesla     247.487373

In [274]:
by_company.min()

              Person  Sales
Company
Dell           Adnan   3010
FB             Ahmad   2243
Tesla    Abdul_Wasay   5000

In [275]:
by_company.max()

           Person  Sales
Company
Dell          Ali   4124
FB        Shaukat   4310
Tesla    Basharat   5350

In [276]:
by_company.count()

         Person  Sales
Company
Dell          2      2
FB            2      2
Tesla         2      2

In [277]:
by_company.describe()

        Sales
        count    mean          std     min      25%     50%      75%     max
Company
Dell      2.0  3567.0   787.716954  3010.0  3288.50  3567.0  3845.50  4124.0
FB        2.0  3276.5  1461.589717  2243.0  2759.75  3276.5  3793.25  4310.0
Tesla     2.0  5175.0   247.487373  5000.0  5087.50  5175.0  5262.50  5350.0

In [278]:
by_company.describe().transpose()

Company             Dell           FB        Tesla
Sales count     2.000000     2.000000     2.000000
      mean   3567.000000  3276.500000  5175.000000
      std     787.716954  1461.589717   247.487373
      min    3010.000000  2243.000000  5000.000000
      25%    3288.500000  2759.750000  5087.500000
      50%    3567.000000  3276.500000  5175.000000
      75%    3845.500000  3793.250000  5262.500000
      max    4124.000000  4310.000000  5350.000000

In [285]:
by_company.describe()

        Sales
        count    mean          std     min      25%     50%      75%     max
Company
Dell      2.0  3567.0   787.716954  3010.0  3288.50  3567.0  3845.50  4124.0
FB        2.0  3276.5  1461.589717  2243.0  2759.75  3276.5  3793.25  4310.0
Tesla     2.0  5175.0   247.487373  5000.0  5087.50  5175.0  5262.50  5350.0

In [286]:
## tranpose it to change the rows to column
## from this we get description of the single company 
by_company.describe().transpose()['Tesla']

Sales  count       2.000000
       mean     5175.000000
       std       247.487373
       min      5000.000000
       25%      5087.500000
       50%      5175.000000
       75%      5262.500000
       max      5350.000000
Name: Tesla, dtype: float64

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [322]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [293]:
## figure out unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [294]:
## Number of unique values
df['col2'].nunique()

3

In [295]:
## 2nd method for numbers of unique values
len(df['col2'].unique())

3

In [296]:
## col2 value counts of elements
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [299]:
## Select from DataFrame using criteria from multiple columns
## col1 > 1
## col2 == 444
new_df = df[(df['col1']>2) & (df['col2']==444)]

In [300]:
new_df

   col1  col2 col3
3     4   444  xyz

In [301]:
new_df1 = df[(df['col1']>2) | (df['col2']==444)]

In [302]:
new_df1

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

### Applying Functions

In [306]:
## Creating a function
def times_two(x):
    return x*2

In [307]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [308]:
## applying to col1
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [309]:
## applying len on col3
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [310]:
## applying to sum to col1
df['col1'].sum()

10

### Permanently Removing a Column

In [323]:
## display the dataframe
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [316]:
## by applying del funtion on col1, it will delete col1 permanently
## same as df.drop and inplace 
del df['col1']

In [318]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### Get column and index names:

In [324]:
## index list of all the column names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [325]:
## index list of all the row names
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting and Ordering a DataFrame:

In [326]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [327]:
## sorting col2 (By Default it goes ascending order)
df.sort_values(by='col2') #inplace=False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [328]:
## sorting col2 by descending order
df.sort_values(by='col2', ascending= False) #inplace=False by default

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [329]:
import numpy as np
import pandas as pd

## CSV
Comma Separated Values files are text files that use commas as field delimeters.<br>
Unless you're running the virtual environment included with the course, you may need to install <tt>xlrd</tt> and <tt>openpyxl</tt>.<br>
In your terminal/command prompt run:

    conda install xlrd
    conda install openpyxl

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

### CSV Input

In [336]:
df = pd.read_csv('example.csv')

In [337]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [334]:
df.to_csv('example.csv',index=False)

# Pandas Exercises
Time to test your new pandas skills! Use the <tt>population_by_county.csv</tt> file in the Data folder to complete the tasks in bold below!

<div class="alert alert-info" style="margin: 10px"><strong>NOTE:</strong> ALL TASKS CAN BE DONE IN ONE LINE OF PANDAS CODE. GET STUCK? NO PROBLEM! CHECK OUT THE SOLUTIONS LECTURE!</div>

<div class="alert alert-danger" style="margin: 10px"><strong>IMPORTANT NOTE!</strong> Make sure you don't run the cells directly above the example output shown, <br>otherwise you will end up writing over the example output!</div>

#### 1. Import pandas and read in the <tt>population_by_county.csv</tt> file into a dataframe called <tt>pop</tt>.

In [338]:
import pandas as pd

In [345]:
pop= pd.read_csv('UDEMY_TSA_FINAL/UDEMY_TSA_FINAL/Data/population_by_county.csv')

In [346]:
pop

                County           State  2010Census  2017PopEstimate
0     Abbeville County  South Carolina       25417            24722
1        Acadia Parish       Louisiana       61773            62590
2      Accomack County        Virginia       33164            32545
3           Ada County           Idaho      392365           456849
4         Adair County            Iowa        7682             7054
...                ...             ...         ...              ...
3137       Yuma County         Arizona      195751           207534
3138       Yuma County        Colorado       10043            10075
3139     Zapata County           Texas       14018            14322
3140     Zavala County           Texas       11677            11948
3141    Ziebach County    South Dakota        2801             2756

[3142 rows x 4 columns]

#### 2. Show the head of the dataframe

In [347]:
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

#### 3. What are the column names?

In [348]:
pop.columns

Index(['County', 'State', '2010Census', '2017PopEstimate'], dtype='object')

<strong>4. How many States are represented in this data set?</strong> <em>Note: the data includes the District of Columbia</em>

In [354]:
pop['State'].nunique()

51

#### 5. Get a list or array of all the states in the data set.

In [355]:
pop['State'].unique()

array(['South Carolina', 'Louisiana', 'Virginia', 'Idaho', 'Iowa',
       'Kentucky', 'Missouri', 'Oklahoma', 'Colorado', 'Illinois',
       'Indiana', 'Mississippi', 'Nebraska', 'North Dakota', 'Ohio',
       'Pennsylvania', 'Washington', 'Wisconsin', 'Vermont', 'Minnesota',
       'Florida', 'North Carolina', 'California', 'New York', 'Wyoming',
       'Michigan', 'Alaska', 'Maryland', 'Kansas', 'Tennessee', 'Texas',
       'Maine', 'Arizona', 'Georgia', 'Arkansas', 'New Jersey',
       'South Dakota', 'Alabama', 'Oregon', 'West Virginia',
       'Massachusetts', 'Utah', 'Montana', 'New Hampshire', 'New Mexico',
       'Rhode Island', 'Nevada', 'District of Columbia', 'Connecticut',
       'Hawaii', 'Delaware'], dtype=object)

#### 6. What are the five most common County names in the U.S.?

In [356]:
pop['County'].value_counts().head()

Washington County    30
Jefferson County     25
Franklin County      24
Lincoln County       23
Jackson County       23
Name: County, dtype: int64

#### 7. What are the top 5 most populated Counties according to the 2010 Census?

In [357]:
pop.sort_values('2010Census', ascending=False).head()

                  County       State  2010Census  2017PopEstimate
1713  Los Angeles County  California     9818605         10163507
628          Cook County    Illinois     5194675          5211263
1209       Harris County       Texas     4092459          4652980
1784     Maricopa County     Arizona     3817117          4307033
2501    San Diego County  California     3095313          3337685

#### 8. What are the top 5 most populated States according to the 2010 Census?

In [358]:
pop.groupby('State').sum().sort_values('2010Census', ascending=False).head()

            2010Census  2017PopEstimate
State
California    37253956         39536653
Texas         25145561         28304596
New York      19378102         19849399
Florida       18801310         20984400
Illinois      12830632         12802023

#### 9. How many Counties have 2010 populations greater than 1 million?

In [360]:
sum(pop['2010Census']>1000000)

39

#### 10. How many Counties don't have the word "County" in their name?

In [361]:
sum(pop['County'].apply(lambda x: 'County' not in x))

135

#### 11. Add a column that calculates the percent change between the 2010 Census and the 2017 Population Estimate

In [366]:
a= pop['2010Census']

In [367]:
a

0        25417
1        61773
2        33164
3       392365
4         7682
         ...
3137    195751
3138     10043
3139     14018
3140     11677
3141      2801
Name: 2010Census, Length: 3142, dtype: int64

In [368]:
b= pop['2017PopEstimate']

In [369]:
b

0        24722
1        62590
2        32545
3       456849
4         7054
         ...
3137    207534
3138     10075
3139     14322
3140     11948
3141      2756
Name: 2017PopEstimate, Length: 3142, dtype: int64

In [370]:
pop['%_Change'] = 100*(b-a)/a

In [371]:
pop.head()

             County           State  2010Census  2017PopEstimate   %_Change
0  Abbeville County  South Carolina       25417            24722  -2.734390
1     Acadia Parish       Louisiana       61773            62590   1.322584
2   Accomack County        Virginia       33164            32545  -1.866482
3        Ada County           Idaho      392365           456849  16.434697
4      Adair County            Iowa        7682             7054  -8.174954

<strong>Bonus: What States have the highest estimated percent change between the 2010 Census and the 2017 Population Estimate?</strong><br>This will take several lines of code, as it requires a recalculation of PercentChange.

In [376]:
pop2 = pd.DataFrame(pop.groupby('State').sum())

In [378]:
pop2['PercentChange'] = 100*(pop2['2017PopEstimate']-pop2['2010Census'])/pop2['2010Census']
pop2.sort_values('PercentChange', ascending=False).head()

                      2010Census  2017PopEstimate    %_Change  PercentChange
State
District of Columbia      601723           693972   15.330808      15.330808
Texas                   25145561         28304596  955.535377      12.562993
North Dakota              672591           755393  308.640607      12.310899
Utah                     2763885          3101833  216.823276      12.227282
Florida                 18801310         20984400  511.173992      11.611372